-- phpMyAdmin SQL Dump
-- version 4.4.15.10
-- https://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Авг 05 2019 г., 22:24
-- Версия сервера: 5.7.23-24
-- Версия PHP: 5.3.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `u0630400_humhub`
--

-- --------------------------------------------------------

--
-- Структура таблицы `recipes`
--

CREATE TABLE IF NOT EXISTS `recipes` (
  `id` int(11) NOT NULL,
  `name_recipes` text NOT NULL,
  `id_recipes` int(11) NOT NULL,
  `item0` text NOT NULL,
  `item1` text NOT NULL,
  `item2` text NOT NULL,
  `item3` text NOT NULL,
  `item4` text NOT NULL,
  `item5` text NOT NULL,
  `item6` text NOT NULL,
  `profession` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=91 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `recipes`
--

INSERT INTO `recipes` (`id`, `name_recipes`, `id_recipes`, `item0`, `item1`, `item2`, `item3`, `item4`, `item5`, `item6`, `profession`) VALUES
(14, 'Настой бездонных глубин', 152639, '152510_5', '152508_10', '152505_15', '', '', '', '', 'alchemy'),
(15, 'Настой силы прибоя', 152641, '152510_5', '152507_10', '152509_15', '', '', '', '', 'alchemy'),
(17, 'Настой стремительных течений', 152638, '152510_5', '152507_10', '152511_15', '', '', '', '', 'alchemy'),
(18, 'Настой бескрайнего горизонта', 152640, '152510_5', '152508_10', '152506_15', '', '', '', '', 'alchemy'),
(19, 'Боевое зелье ловкости', 163223, '152509_8', '152505_10', '', '', '', '', '', 'alchemy'),
(20, 'Боевое зелье интеллекта', 163222, '152509_10', '152505_8', '', '', '', '', '', 'alchemy'),
(21, 'Боевое зелье силы', 163224, '152511_10', '152506_8', '', '', '', '', '', 'alchemy'),
(22, 'Превосходное боевое зелье ловкости', 168489, '168487_8', '152505_3', '', '', '', '', '', 'alchemy'),
(23, 'Превосходное боевое зелье интеллекта', 168498, '168487_8', '152509_3', '', '', '', '', '', 'alchemy'),
(24, 'Превосходное боевое зелье силы', 168500, '168487_8', '152506_3', '', '', '', '', '', 'alchemy'),
(25, 'Зелье неукротимой ярости', 169299, '168487_6', '', '', '', '', '', '', 'alchemy'),
(26, 'Зелье восполнения', 152561, '152509_10', '152506_8', '', '', '', '', '', 'alchemy'),
(32, 'Зажигательные боеприпасы', 158203, '152512_12', '', '', '', '', '', '', 'engineer'),
(33, 'Чары для оружия - смертоносная навигация', 159785, '152876_5', '152875_15', '152877_1', '', '', '', '', 'enchantment'),
(37, 'Зелье дикого исцеления', 169300, '168487_6', '', '', '', '', '', '', 'alchemy'),
(39, 'Зелье упорной сосредоточенности', 168506, '168487_8', '152508_3', '', '', '', '', '', 'alchemy'),
(40, 'Зелье усиливающего окружения', 168529, '168487_8', '152508_3', '', '', '', '', '', 'alchemy'),
(41, 'Превосходное боевое зелье выносливости', 168499, '168487_8', '152511_3', '', '', '', '', '', 'alchemy'),
(42, 'Глубоководное лечебное зелье', 169451, '168487_2', '', '', '', '', '', '', 'alchemy'),
(43, 'Превосходное зелье стальной кожи', 168501, '168487_8', '152507_3', '', '', '', '', '', 'alchemy'),
(44, 'Сильный настой бездонных глубин', 168652, '168487_20', '152505_5', '152510_5', '', '', '', '', 'alchemy'),
(45, 'Сильный настой бескрайнего горизонта', 168653, '168487_20', '152506_5', '152510_5', '', '', '', '', 'alchemy'),
(46, 'Сильный настой силы прибоя', 168654, '168487_20', '152509_5', '152510_5', '', '', '', '', 'alchemy'),
(47, 'Сильный настой стремительных течений', 168651, '168487_20', '152511_5', '152510_5', '', '', '', '', 'alchemy'),
(48, 'Зелье легкой поступи', 152497, '152506_10', '', '', '', '', '', '', 'alchemy'),
(49, 'Зелье всевидящего ока', 166270, '152506_3', '152511_3', '', '', '', '', '', 'alchemy'),
(50, 'Зелье морских туманов', 152550, '152511_10', '', '', '', '', '', '', 'alchemy'),
(51, 'Зелье обмана Демитрия', 152496, '152543_5', '152511_5', '', '', '', '', '', 'alchemy'),
(52, 'Зелье сокрытия', 152503, '152509_10', '', '', '', '', '', '', 'alchemy'),
(53, 'Зелье смертоносного прилива', 152559, '152511_8', '152506_6', '', '', '', '', '', 'alchemy'),
(54, 'Зелье стальной кожи', 152557, '152511_10', '152505_8', '', '', '', '', '', 'alchemy'),
(55, 'Зелье кровавого всплеска', 152560, '152509_8', '152505_6', '', '', '', '', '', 'alchemy'),
(56, 'Деформатор зловещего бойца', 164680, '152579_25', '152513_15', '', '', '', '', '', 'engineer'),
(57, 'Заиндевевшие боеприпасы', 158377, '152512_12', '', '', '', '', '', '', 'engineer'),
(58, 'Монелитовый прицел расторопности', 158327, '152512_10', '152579_5', '', '', '', '', '', 'engineer'),
(59, 'Прицел "вороньего гнезда"', 158212, '152512_10', '152579_5', '', '', '', '', '', 'engineer'),
(60, 'Нестабильный манипулятор темпорального потока', 158379, '152512_8', '152579_6', '', '', '', '', '', 'engineer'),
(61, '"Турбопосудина XA-1000"', 153512, '152512_10', '152579_5', '', '', '', '', '', 'engineer'),
(62, 'Межпространственное хранилище питомцев', 153510, '152512_5', '152579_4', '', '', '', '', '', 'engineer'),
(63, 'Портативный трансмогрификатор', 153597, '152512_5', '152579_4', '', '', '', '', '', 'engineer'),
(64, 'Электрошокер для мотивирования транспортных', 153573, '152512_8', '152579_4', '', '', '', '', '', 'engineer'),
(65, '"ЖГУН"', 153490, '152512_4', '', '', '', '', '', '', 'engineer'),
(66, 'Граната органического антиперенаправления', 153487, '152512_4', '', '', '', '', '', '', 'engineer'),
(67, 'Турбораспространитель чумы', 153494, '152512_4', '', '', '', '', '', '', 'engineer'),
(68, 'Пресекатель магических посягательств', 158380, '152512_8', '152579_4', '', '', '', '', '', 'engineer'),
(70, 'Чары для оружия – усилитель', 168596, '152876_4', '152875_20', '152877_2', '', '', '', '', 'enchantment'),
(71, 'Чары для оружия – гениальность машиниста', 168593, '152876_4', '152875_20', '152877_2', '', '', '', '', 'enchantment'),
(72, 'Чары для оружия – шкура наги', 168598, '152876_5', '152875_22', '152877_3', '', '', '', '', 'enchantment'),
(73, 'Чары для оружия - быстрая навигация', 159786, '152876_6', '152875_18', '152877_1', '', '', '', '', 'enchantment'),
(74, 'Чары для оружия - универсальная навигация', 159788, '152876_5', '152875_15', '152877_1', '', '', '', '', 'enchantment'),
(75, 'Чары для оружия - искусная навигация', 159787, '152876_6', '152875_18', '152877_1', '', '', '', '', 'enchantment'),
(76, 'Чары для оружия - надежная навигация', 159789, '152876_5', '152875_15', '152877_1', '', '', '', '', 'enchantment'),
(77, 'Чары для оружия - ураганные удары', 153480, '152876_4', '152875_18', '152877_1', '', '', '', '', 'enchantment'),
(78, 'Чары для оружия - вихрь стихи', 153479, '152876_3', '152875_15', '152877_1', '', '', '', '', 'enchantment'),
(79, 'Чары для оружия - вытягивание', 153478, '152876_3', '152875_15', '152877_1', '', '', '', '', 'enchantment'),
(80, 'Чары для оружия - прибрежная волна', 153476, '152876_3', '152875_15', '152877_1', '', '', '', '', 'enchantment'),
(81, 'Чары для оружия – океанское восстановление', 168592, '152876_4', '152875_20', '152877_2', '', '', '', '', 'enchantment'),
(82, 'Латные поножи отъявленного бойца', 167971, '168185_20', '152579_5', '', '', '', '', '', 'blacksmithing'),
(83, 'Латные рукавицы отъявленного бойца', 167969, '168185_12', '152579_3', '', '', '', '', '', 'blacksmithing'),
(84, 'Латные сапоги отъявленного бойца', 167967, '168185_12', '152579_3', '', '', '', '', '', 'blacksmithing'),
(85, 'Латный пояс отъявленного бойца', 167973, '168185_12', '152579_3', '', '', '', '', '', 'blacksmithing'),
(86, 'Колотушка отъявленного бойца', 167939, '168185_20', '152579_5', '', '', '', '', '', 'blacksmithing'),
(87, 'Кольцо с левиафановым глазом', 168701, '168635_3', '168188_35', '168193_35', '', '', '', '', 'jewelcrafting'),
(88, 'Атласные башмаки отъявленного бойца', 167979, '167738_15', '152577_5', '', '', '', '', '', 'tailoring'),
(89, ' Атласные наручи отъявленного бойца', 167981, '167738_7', '152577_4', '', '', '', '', '', 'tailoring'),
(90, 'Кожаные ботфорты отъявленного бойца', 167951, '168649_10', '154722_5', '154164_15', '', '', '', '', 'leatherworking');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `recipes`
--
ALTER TABLE `recipes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id_recipes` (`id_recipes`),
  ADD UNIQUE KEY `id_recipes_2` (`id_recipes`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `recipes`
--
ALTER TABLE `recipes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=91;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
